hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node_38Pin/src/Aquaponic_LoRa_Transmitter.cpp
  Serial.println("Config applied and saved to flash.");
  server.send(200, "application/json", "{\"status\":\"ok\"}");
}

void handleNotFound() {
  Serial.print("HTTP 404: ");
  Serial.println(server.uri());
  addCommonHeaders();
  server.send(
      404,
      "application/json",
      "{\"status\":\"not found\",\"hint\":\"use /, /health or /config\"}");
}
#endif

// ================= LORA & SMART COMMUNICATION =================

void appendSegment(std::vector<SensorSegment> &segments, int pin, const String &sensorName, const String &rawValue) {
  SensorSegment segment;
  segment.pin = pin;
  segment.sensorName = sensorName;
  segment.rawValue = rawValue;
  segment.segment = String(pin) + "=" + sensorName + "=" + rawValue;
  segments.push_back(segment);
}

void sampleSensors() {
  std::vector<SensorSegment> sampledSegments;
  uint8_t highestPriority = SmartPacket::PRIORITY_LOW;

  for (size_t i = 0; i < configList.size(); i++) {
    auto c = configList[i];

    if (c.sensor == "DHT22" && dhtSensors[i]) {
      float temp = dhtSensors[i]->readTemperature();
      float humidity = dhtSensors[i]->readHumidity();
      String tempValue = isnan(temp) ? "nan" : String(temp, 1);
      String humidityValue = isnan(humidity) ? "nan" : String(humidity, 1);

      appendSegment(sampledSegments, c.pin, "Temperature", tempValue);
      appendSegment(sampledSegments, c.pin, "Humidity", humidityValue);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Temperature", tempValue));
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Humidity", humidityValue));
    } else if (c.sensor == "WaterTemp" && tempSensors[i]) {
      tempSensors[i]->requestTemperatures();
      String value = String(tempSensors[i]->getTempCByIndex(0), 1);
      appendSegment(sampledSegments, c.pin, "WaterTemp", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("WaterTemp", value));
    } else if (c.sensor == "pH") {
      String value = String(readPH(analogRead(c.pin)), 2);
      appendSegment(sampledSegments, c.pin, "pH", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("pH", value));
    } else if (c.sensor == "TDS") {
      String value = String(readTDS(analogRead(c.pin)), 2);
      appendSegment(sampledSegments, c.pin, "TDS", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("TDS", value));
    } else if (c.sensor == "Turbidity") {
      String value = readTurbidity(analogRead(c.pin));
      appendSegment(sampledSegments, c.pin, "Turbidity", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Turbidity", value));
    } else if (c.sensor == "Rain") {
      String value = String(digitalRead(c.pin));
      appendSegment(sampledSegments, c.pin, "Rain", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Rain", value));
    }
  }

  latestSegments = sampledSegments;
  updateReportMode(highestPriority);
}

String buildPlainPayload(uint32_t sequence, uint8_t priority, uint8_t reportMode) {
  String payload = "auth=" + runtimeAuthKey;
  payload += "&hardware_id=" + runtimeHardwareId;
  payload += "&seq=" + String(sequence);
  payload += "&priority=" + SmartPacket::priorityLabel(priority);
  payload += "&mode=" + SmartPacket::reportModeLabel(reportMode);
  payload += "&sample_ms=" + String(SAMPLE_INTERVAL_MS);
  payload += "&report_ms=" + String(currentReportIntervalMs);
  return payload;
}

String buildTelemetryPayloadChunk(
    uint32_t sequence,
    uint8_t priority,
    uint8_t reportMode,
    size_t &segmentIndex,
    uint16_t packetPart) {
  String payload = buildPlainPayload(sequence, priority, reportMode);
  payload += "&packet_part=" + String(packetPart);
  payload += "&";
  const size_t startIndex = segmentIndex;

  while (segmentIndex < latestSegments.size()) {
    String nextSegment = latestSegments[segmentIndex].segment + "&";
    if (payload.length() + nextSegment.length() > MAX_PLAIN_PAYLOAD_BYTES && segmentIndex > startIndex) {
      break;
    }
    payload += nextSegment;
    segmentIndex++;
  }

  return payload;
}

String buildLocationSyncPayload(uint32_t sequence) {
  String payload = "auth=" + runtimeAuthKey;
  payload += "&meta=location";
  payload += "&hardware_id=" + runtimeHardwareId;
  payload += "&seq=" + String(sequence);
  payload += "&lat=" + String(runtimeSettings.latitude, 6);
  payload += "&lon=" + String(runtimeSettings.longitude, 6);
  payload += "&distance=" + String(runtimeSettings.distanceMeters, 1);
  return payload;
}

void fillNonce(uint8_t nonce[SmartPacket::NONCE_SIZE], uint32_t sequence) {
  memset(nonce, 0, SmartPacket::NONCE_SIZE);
  uint32_t now = millis();
  uint32_t randomValue = esp_random();
  uint32_t nodeId = runtimeSettings.nodeId;
  memcpy(nonce, &sequence, sizeof(sequence));
  memcpy(nonce + 4, &now, sizeof(now));
  memcpy(nonce + 8, &randomValue, sizeof(randomValue));
  memcpy(nonce + 12, &nodeId, sizeof(nodeId));
}

std::vector<uint8_t> encryptCtrPayload(const String &plainText, const uint8_t nonce[SmartPacket::NONCE_SIZE]) {
  std::vector<uint8_t> output(plainText.length(), 0);
  std::vector<uint8_t> nonceCounter(SmartPacket::NONCE_SIZE, 0);
  memcpy(nonceCounter.data(), nonce, SmartPacket::NONCE_SIZE);

  size_t ncOffset = 0;
  unsigned char streamBlock[16] = {0};

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, reinterpret_cast<const unsigned char *>(runtimeAesKey.c_str()), 128);
  mbedtls_aes_crypt_ctr(
      &aes,
      plainText.length(),
      &ncOffset,
      nonceCounter.data(),
      streamBlock,
      reinterpret_cast<const unsigned char *>(plainText.c_str()),
      output.data());
  mbedtls_aes_free(&aes);

  return output;
}

std::vector<uint8_t> buildStructuredPacket(const String &plainText, uint8_t priority, uint8_t reportMode, uint32_t sequence) {
  uint8_t nonce[SmartPacket::NONCE_SIZE];
  fillNonce(nonce, sequence);
  std::vector<uint8_t> encryptedPayload = encryptCtrPayload(plainText, nonce);

