hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node_38Pin/src/Aquaponic_LoRa_Transmitter.cpp
void sendCurrentTelemetry(bool forceImmediate) {
  if (latestSegments.empty()) {
    return;
  }

  bool intervalElapsed = (millis() - lastReportMs) >= currentReportIntervalMs;
  if (!forceImmediate && !intervalElapsed) {
    return;
  }

  size_t segmentIndex = 0;
  uint16_t packetPart = 1;
  bool allChunksSent = true;

  while (segmentIndex < latestSegments.size()) {
    uint32_t sequence = packetSeq++;
    String plainText = buildTelemetryPayloadChunk(
        sequence,
        currentPriority,
        currentReportMode,
        segmentIndex,
        packetPart);
    std::vector<uint8_t> packetBytes = buildStructuredPacket(plainText, currentPriority, currentReportMode, sequence);

    if (sendBinaryPacket(packetBytes)) {
      Serial.println("\n========== LORA PACKET CHUNK ==========");
      Serial.print("Sequence: ");
      Serial.println(sequence);
      Serial.print("Part: ");
      Serial.println(packetPart);
      Serial.print("Priority: ");
      Serial.println(SmartPacket::priorityLabel(currentPriority));
      Serial.print("Report mode: ");
      Serial.println(SmartPacket::reportModeLabel(currentReportMode));
      Serial.print("Payload length: ");
      Serial.println(plainText.length());
      Serial.print("Packet length: ");
      Serial.println(packetBytes.size());
      Serial.println("Packet chunk sent securely.");
      Serial.println("=======================================\n");
    } else {
      allChunksSent = false;
      Serial.println("LoRa send failed. Queueing packet chunk.");
      enqueuePendingPacket(packetBytes, currentPriority, currentReportMode, sequence);
    }

    packetPart++;
    delay(35);
  }

  lastReportMs = millis();
  if (allChunksSent) {
    criticalDispatchPending = false;
  }
}

void sendLocationSyncIfNeeded() {
  if (!metadataSyncPending) {
    return;
  }

  uint32_t sequence = packetSeq++;
  String payload = buildLocationSyncPayload(sequence);
  std::vector<uint8_t> packetBytes = buildStructuredPacket(
      payload,
      SmartPacket::PRIORITY_LOW,
      SmartPacket::REPORT_MODE_NORMAL,
      sequence);

  if (sendBinaryPacket(packetBytes)) {
    metadataSyncPending = false;
    Serial.println("Location sync packet sent after config update.");
  } else {
    enqueuePendingPacket(packetBytes, SmartPacket::PRIORITY_LOW, SmartPacket::REPORT_MODE_NORMAL, sequence);
    Serial.println("Location sync packet queued for retry.");
  }
}

// ================= SENSOR CALIBRATION FUNCTIONS =================
// These are default calibration values - adjust based on your sensor

// pH Sensor Calibration
// Default: Neutral pH7 = 1500 raw, Acid pH4 = 1000 raw, Alkaline pH10 = 2000 raw
// Formula: pH = ((raw - neutralRaw) / slope) + 7
float readPH(int raw) {
  // ESP32 ADC: 0-4095, typically pH7 reads around half (2048)
  // Calibration values - adjust these for your sensor!
  const float neutralRaw = 1500.0;  // Raw value at pH 7
  const float slope = 250.0;       // Raw change per pH unit

  float ph = ((raw - neutralRaw) / slope) + 7.0;

  // Clamp to valid range
  if (ph < 0) ph = 0;
  if (ph > 14) ph = 14;

  return ph;
}

// TDS Sensor Calibration
// Default: 0 raw = 0 PPM, 4095 raw = ~2000 PPM
// Formula: PPM = (raw / 4095.0) * 2000 * multiplier
float readTDS(int raw) {
  // Typical conversion: 1 unit ADC ~ 0.5 PPM
  // For 0-4095 ADC range mapping to 0-2000 PPM
  const float multiplier = 0.5;

  float tds = (raw / 4095.0) * 2000.0 * multiplier;

  return tds;
}

// Turbidity Sensor
// Returns NTU value and status text
String readTurbidity(int raw) {
  // ESP32: 0 = clear (high voltage), 4095 = murky (low voltage)
  // Map raw ADC to NTU (Nephelometric Turbidity Units)
  // Typical: 0 ADC = ~0 NTU (clear), 4095 ADC = ~3000 NTU (very murky)

  const float maxNTU = 3000.0;
  float ntu = ((float)raw / 4095.0) * maxNTU;

  // Return formatted string: "123.5" or use the helper below
  // For app compatibility, we'll return just the NTU value as string
  // The app can then display as "Clear" if < 10, "Murky" if > 100, etc.
  return String(ntu, 1);
}

// Alternative: Get turbidity status string
String getTurbidityStatus(int raw) {
  float ntu = ((float)raw / 4095.0) * 3000.0;

  if (ntu < 10) return "Clear";
  else if (ntu < 50) return "Slightly Cloudy";
  else if (ntu < 100) return "Cloudy";
  else if (ntu < 500) return "Murky";
  else return "Very Murky";
}

void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println();
  Serial.println("BOOT OK");
  Serial.println("Starting SmartPonic node...");
  runtimeHardwareId = getHardwareId();
  Serial.println("Hardware ID: " + runtimeHardwareId);

  for (int i = 0; i < MAX_SENSORS; i++) {
    dhtSensors[i] = nullptr;
    oneWireSensors[i] = nullptr;
    tempSensors[i] = nullptr;
  }
  Serial.println("Sensor slots initialized");

#ifdef NFC_CONFIG_ENABLED
  // Initialize NFC for configuration (WiFi AP disabled)
  Serial.println("Initializing NFC config reader...");
  nfcReady = nfcReader.begin();
  if (nfcReady) {
    Serial.println("NFC reader ready - tap NFC tag to configure");
  } else {
    Serial.println("NFC init failed: " + nfcReader.getLastError());
  }
#else
  // WiFi AP mode for configuration
  IPAddress localIp(192, 168, 4, 1);
  IPAddress gateway(192, 168, 4, 1);
  IPAddress subnet(255, 255, 255, 0);
  const char *headerKeys[] = {nodeKeyHeader};

  WiFi.mode(WIFI_AP);
  if (!WiFi.softAPConfig(localIp, gateway, subnet)) {
    Serial.println("AP IP config failed");
  }

  bool apReady = WiFi.softAP(ssid, password);
  Serial.print("Access Point status: ");
  Serial.println(apReady ? "ready" : "failed");
  Serial.print("Access Point SSID: ");
  Serial.println(ssid);
  Serial.print("Access Point IP: ");
  Serial.println(WiFi.softAPIP());

  server.on("/", HTTP_GET, handleRoot);
  server.on("/health", HTTP_GET, handleHealth);
  server.collectHeaders(headerKeys, 1);
  server.on("/config", HTTP_OPTIONS, handleOptions);
  server.on("/config", HTTP_POST, handlePostConfig);
  server.on("/config", HTTP_GET, handleGetConfig);
  server.onNotFound(handleNotFound);
  server.begin();
  Serial.println("HTTP config server started");
  Serial.println("Open http://192.168.4.1/ in your browser");
#endif

