hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node_38Pin/src/Aquaponic_LoRa_Transmitter.cpp
  prefs.begin(configNamespace, true);
  String savedJson = prefs.getString(configJsonPrefKey, "");
  prefs.end();
  Serial.print("Saved config bytes: ");
  Serial.println(savedJson.length());
  Serial.print("Node security key configured: ");
  Serial.println(loadNodeSecurityKey().isEmpty() ? "no" : "yes");

  // Load AES and Auth keys from secure flash storage
  loadSecureKeys();

  if (savedJson != "") {
    DynamicJsonDocument doc(4096);
    DeserializationError error = deserializeJson(doc, savedJson);
    if (error) {
      Serial.print("Saved config parse failed: ");
      Serial.println(error.f_str());
    } else if (doc.containsKey("config")) {
      loadRuntimeSettingsFromDocument(doc);
      applyConfig(doc["config"]);
      Serial.println("Saved config applied");
    }
  }

  SPI.begin(LORA_SCK, LORA_MISO, LORA_MOSI, LORA_SS);
  LoRa.setPins(LORA_SS, LORA_RST, LORA_DIO0);
  loraReady = LoRa.begin(433E6);
  if (loraReady) {
    LoRa.setSyncWord(LORA_SYNC_WORD);
    LoRa.receive();
    Serial.println("System Ready");
  } else {
    Serial.println("LoRa init failed");
  }

  // ADD THIS: start with an immediate sample so the first report has fresh data
  sampleSensors();
}

void loop() {
#ifdef NFC_CONFIG_ENABLED
  // NFC config mode - check for NFC tag periodically
  static unsigned long lastNfcCheckMs = 0;
  if (nfcReady && millis() - lastNfcCheckMs >= 3000) {
    lastNfcCheckMs = millis();
    if (nfcReader.isCardPresent()) {
      Serial.println("NFC card detected - reading config...");
      String configJson, authKey;
      if (nfcReader.readConfig(configJson, authKey)) {
        Serial.println("NFC config read successfully");
        // Save config to flash
        prefs.begin(configNamespace, false);
        prefs.putString(configJsonPrefKey, configJson);
        prefs.putString(nodeSecurityPrefKey, authKey);
        prefs.end();
        Serial.println("Config saved to flash");

        // Apply the new config
        DynamicJsonDocument doc(4096);
        DeserializationError error = deserializeJson(doc, configJson);
        if (error) {
          Serial.print("Config parse failed: ");
          Serial.println(error.f_str());
        } else {
          if (doc.containsKey("config")) {
            loadRuntimeSettingsFromDocument(doc);
            applyConfig(doc["config"]);
            Serial.println("NFC config applied");
          }
        }
      } else {
        Serial.println("NFC read failed: " + nfcReader.getLastError());
      }
    }
  }
#else
  // WiFi AP config mode
  server.handleClient();
  handleIncomingControl();
#endif

  if (millis() - lastSampleMs >= SAMPLE_INTERVAL_MS) {
    lastSampleMs = millis();
    sampleSensors();
  }

  if (currentPriority == SmartPacket::PRIORITY_HIGH && criticalDispatchPending) {
    sendCurrentTelemetry(true);
  } else {
    sendCurrentTelemetry(false);
  }

  sendLocationSyncIfNeeded();
  retryPendingPacketsIfNeeded();
  handleIncomingControl();

  // Handle serial commands for configuration
  if (Serial.available()) {
    String input = Serial.readStringUntil('\n');
    input.trim();
    handleSerialCommand(input);
  }
}

// ================= SERIAL CONFIG COMMANDS =================
void handleSerialCommand(String input) {
  if (input.length() == 0) return;

  Serial.println("\n>>> Command: " + input);
  String command = input;
  command.toUpperCase();

  if (command == "HELP") {
    Serial.println("=== AVAILABLE COMMANDS ===");
    Serial.println("HELP           - Show this help");
    Serial.println("LIST           - Show current sensor config");
    Serial.println("CLEAR          - Clear all sensor config");
    Serial.println("ADD,pin,type,sensor,label - Add sensor");
    Serial.println("META,nodeAddress,lat,lon,distance - Update node metadata");
    Serial.println("ID             - Show ESP32 hardware identity");
#ifdef NFC_CONFIG_ENABLED
    Serial.println("NFCREAD        - Read config from NFC tag");
#endif
    Serial.println("");
    Serial.println("KEY MANAGEMENT:");
    Serial.println("SETKEYS,AES128=xxx,AUTH=yyy - Set AES(16char) + Auth keys");
    Serial.println("SHOWKEYS       - Show current keys (masked)");
    Serial.println("CLEARKEYS      - Reset keys to defaults");
    Serial.println("");
    Serial.println("Examples:");
    Serial.println("ADD,4,AI,DHT22,TempSensor");
    Serial.println("ADD,21,AI,WaterTemp,WaterTemp");
    Serial.println("ADD,34,AI,pH,pHSensor");
    Serial.println("ADD,35,AI,TDS,TDSensor");
    Serial.println("ADD,36,AI,Turbidity,TurbSensor");
    Serial.println("ADD,39,DI,Rain,RainSensor");
    Serial.println("");
    Serial.println("type: AI=Input (sensors), DI=Digital Input");
    Serial.println("sensor: DHT22, WaterTemp, pH, TDS, Turbidity, Rain");
    return;
  }

#ifdef NFC_CONFIG_ENABLED
  if (command == "NFCREAD") {
    Serial.println("Waiting for NFC tag...");
    String configJson, authKey;
    if (nfcReader.waitForCard(10000)) {
      if (nfcReader.readConfig(configJson, authKey)) {
        Serial.println("NFC config read successfully");
        prefs.begin(configNamespace, false);
        prefs.putString(configJsonPrefKey, configJson);
        prefs.putString(nodeSecurityPrefKey, authKey);
        prefs.end();
        Serial.println("Config saved to flash");

        DynamicJsonDocument doc(4096);
        DeserializationError error = deserializeJson(doc, configJson);
        if (!error && doc.containsKey("config")) {
          loadRuntimeSettingsFromDocument(doc);
          applyConfig(doc["config"]);
          Serial.println("NFC config applied");
        }
      } else {
        Serial.println("NFC read failed: " + nfcReader.getLastError());
      }
    } else {
      Serial.println("No NFC card detected");
    }
    return;
  }
#endif

  if (command == "LIST") {
    Serial.println("=== CURRENT CONFIG ===");
    Serial.println("Count: " + String(configList.size()));
    for (size_t i = 0; i < configList.size(); i++) {
      auto c = configList[i];
      Serial.println("  " + String(i+1) + ". Pin:" + String(c.pin) +
                     " Type:" + c.type +
                     " Sensor:" + c.sensor +
                     " Label:" + c.label);
    }
    Serial.println("Hardware ID: " + runtimeHardwareId);
    Serial.println("LoRa address: " + String(runtimeSettings.nodeId));
    Serial.println("Latitude: " + String(runtimeSettings.latitude, 6));
    Serial.println("Longitude: " + String(runtimeSettings.longitude, 6));
    Serial.println("Distance(m): " + String(runtimeSettings.distanceMeters, 1));
    Serial.println("Pending queue: " + String(pendingPackets.size()));
    return;
  }

  if (command == "CLEAR") {
    configList.clear();
    latestSegments.clear();
    Serial.println("Config cleared!");
    return;
  }

  if (command == "ID") {
    Serial.println("=== HARDWARE IDENTITY ===");
    Serial.println("Hardware ID (EUI-64): " + runtimeHardwareId);
    Serial.println("LoRa transport address: " + String(runtimeSettings.nodeId));
    Serial.println("Chip model: " + String(ESP.getChipModel()));
    Serial.println("Chip revision: " + String(ESP.getChipRevision()));
    return;
  }

  if (command.startsWith("META,")) {
    String parts[4];
    int partIdx = 0;
    int start = 5;
    for (int i = 5; i <= input.length(); i++) {
      if (i == input.length() || input[i] == ',') {
        parts[partIdx] = input.substring(start, i);
        start = i + 1;
        partIdx++;
        if (partIdx >= 4) break;
      }
    }

