hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node_38Pin/src/Aquaponic_LoRa_Transmitter.cpp
    if (partIdx < 4) {
      Serial.println("ERROR: Invalid format. Use: META,nodeAddress,lat,lon,distance");
      return;
    }

    runtimeSettings.nodeId = (uint8_t) max(1, (int) parts[0].toInt());
    runtimeSettings.latitude = parts[1].toFloat();
    runtimeSettings.longitude = parts[2].toFloat();
    runtimeSettings.distanceMeters = parts[3].toFloat();
    Serial.println("Node metadata updated.");
    return;
  }

  if (command.startsWith("SETKEYS,")) {
    // Format: SETKEYS,AES128=your16charkey,AUTH=yourauthkey
    String args = input.substring(8);
    bool aesSet = false;
    bool authSet = false;

    int aesPos = args.indexOf("AES128=");
    int authPos = args.indexOf("AUTH=");

    if (aesPos >= 0) {
      int aesEnd = args.indexOf(",", aesPos);
      if (aesEnd < 0) aesEnd = args.length();
      String aesKey = args.substring(aesPos + 7, aesEnd);
      aesKey.trim();
      if (aesSet = saveAesKey(aesKey)) {
        // Key saved
      }
    }

    if (authPos >= 0) {
      int authEnd = args.indexOf(",", authPos);
      if (authEnd < 0) authEnd = args.length();
      String authKey = args.substring(authPos + 5, authEnd);
      authKey.trim();
      if (authSet = saveAuthKey(authKey)) {
        // Key saved
      }
    }

    if (!aesSet && !authSet) {
      Serial.println("ERROR: Invalid format. Use: SETKEYS,AES128=your16charkey,AUTH=yourauthkey");
      Serial.println("Example: SETKEYS,AES128=SmartPonic123456,AUTH=AQUA77");
    } else {
      if (aesSet) Serial.println("AES key: " + runtimeAesKey);
      if (authSet) Serial.println("Auth key: " + runtimeAuthKey);
    }
    return;
  }

  if (command == "SHOWKEYS") {
    Serial.println("=== SECURE KEYS ===");
    Serial.println("AES key: " + runtimeAesKey);
    Serial.println("Auth key: " + runtimeAuthKey);
    return;
  }

  if (command == "CLEARKEYS") {
    clearSecureKeys();
    return;
  }

  if (command.startsWith("ADD,")) {
    // Format: ADD,pin,type,sensor,label
    String parts[4];
    int partIdx = 0;
    int start = 4;
    for (int i = 4; i <= input.length(); i++) {
      if (input[i] == ',' || i == input.length()) {
        parts[partIdx] = input.substring(start, i);
        start = i + 1;
        partIdx++;
        if (partIdx >= 4) break;
      }
    }

    if (partIdx < 3) {
      Serial.println("ERROR: Invalid format. Use: ADD,pin,type,sensor,label");
      return;
    }

    int pin = parts[0].toInt();
    String type = parts[1];
    type.toUpperCase();
    String sensor = canonicalSensorName(parts[2]);
    String label = parts[3];

    if (configList.size() >= MAX_SENSORS) {
      Serial.println("ERROR: Maximum sensor limit reached!");
      return;
    }

    if (!isSafePin(pin)) {
      Serial.println("ERROR: Pin " + String(pin) + " is not safe to use!");
      Serial.println("Safe pins: 4,13,16,17,21,22,25,26,27,32,33,34,35,36,39");
      return;
    }

    for (size_t i = 0; i < configList.size(); i++) {
      if (configList[i].pin == pin && configList[i].sensor == sensor) {
        Serial.println("ERROR: Duplicate sensor config detected!");
        return;
      }
    }

    configList.push_back({pin, type, sensor, label});

    // Initialize sensor if needed
    int idx = configList.size() - 1;
    if (sensor == "DHT22") {
      dhtSensors[idx] = new DHT(pin, DHT22);
      dhtSensors[idx]->begin();
    } else if (sensor == "WaterTemp") {
      oneWireSensors[idx] = new OneWire(pin);
      tempSensors[idx] = new DallasTemperature(oneWireSensors[idx]);
      tempSensors[idx]->begin();
    }

    if (type == "DO") {
      pinMode(pin, OUTPUT);
    } else {
      pinMode(pin, INPUT);
    }

    Serial.println("Sensor added: Pin " + String(pin) + " as " + sensor);
    return;
  }

  Serial.println("Unknown command. Type HELP for available commands.");
}
